-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Tirkeshov_Murat\Downloads\osfstorage-archive\raw\assignment.log
  log type:  text
 opened on:   7 Nov 2024, 15:24:10

. import delimited "worldbank-lifeexpectancy-raw.csv", clear
(encoding automatically selected: ISO-8859-1)
(7 vars, 12,803 obs)

. drop if gdp == ".." // drop missing values
(7,393 observations deleted)

. drop if life == ".."
(381 observations deleted)

. gen ppp = real(gdp) // generate a new variable with float value

. gen expc = real(lifeexpectancy)

. sum expc, detail // summerize for deatils, and to create a new categories(by 25%, 4 categories)

                            expc
-------------------------------------------------------------
      Percentiles      Smallest
 1%       44.109          27.61
 5%       49.337         28.102
10%       53.415         29.003       Obs               5,029
25%       62.399         30.434       Sum of wgt.       5,029

50%       70.628                      Mean           68.27242
                        Largest       Std. dev.      9.612734
75%      75.2878       84.22683
90%     78.93171       84.27805       Variance       92.40465
95%     80.87805       84.68049       Skewness      -.8171016
99%     82.62683       85.41708       Kurtosis       3.077933

. sum ppp, detail 

                             ppp
-------------------------------------------------------------
      Percentiles      Smallest
 1%     697.9293       361.0908
 5%     1063.908       377.3086
10%     1500.511       380.0883       Obs               5,029
25%     2969.885       385.0825       Sum of wgt.       5,029

50%     8677.656                      Mean           15835.32
                        Largest       Std. dev.      18744.32
75%        22394       124024.6
90%     40136.74       124235.8       Variance       3.51e+08
95%     48473.71       130439.2       Skewness       2.251013
99%     92349.19       134960.1       Kurtosis       9.534141

. 
. gen pppcat = 1 if ppp<2970
(3,771 missing values generated)

. replace pppcat=2 if (ppp>=2970)&(ppp<8678)
(1,257 real changes made)

. replace pppcat=3 if (ppp>=8678)&(ppp<22394)
(1,257 real changes made)

. replace pppcat=4 if ppp>=22394
(1,257 real changes made)

. 
. gen expccat = 1 if expc<62.4
(3,771 missing values generated)

. replace expccat=2 if (expc>=62.4)&(expc<70.63)
(1,257 real changes made)

. replace expccat=3 if (expc>=70.63)&(expc<75.23)
(1,241 real changes made)

. replace expccat=4 if expc>=75.23
(1,273 real changes made)

. 
. sort pppcat

. by pppcat: sum expccat // summerize by categories

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> pppcat = 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     expccat |      1,258    1.294118    .5117369          1          3

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> pppcat = 2

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     expccat |      1,257    2.135243    .7385047          1          4

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> pppcat = 3

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     expccat |      1,257     2.84646    .8223426          1          4

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> pppcat = 4

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     expccat |      1,257    3.736675    .5542535          1          4


. 
. sort expccat

. by expccat: sum pppcat

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> expccat = 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
      pppcat |      1,258    1.352941    .6489047          1          4

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> expccat = 2

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
      pppcat |      1,257    2.041368    .7559998          1          4

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> expccat = 3

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
      pppcat |      1,241    2.842869    .7450695          1          4

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> expccat = 4

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
      pppcat |      1,273    3.750982    .4808121          2          4


. 
. graph bar, over(pppcat) over(expccat) stack asyvar percentage // graph by categories in percentage, but each category has nearly same observations.

. 
. twoway (scatter ppp expc) (lowess ppp expc) // scatter plot with lowess

. 
. log close
      name:  <unnamed>
       log:  C:\Users\Tirkeshov_Murat\Downloads\osfstorage-archive\raw\assignment.log
  log type:  text
 closed on:   7 Nov 2024, 15:24:25
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
